application/app/Http/Controllers/Admin/ProductController.php

    public function Edit($id)
    {
        $product = Product::find($id);
        $productImages = ProductImage::where('product_id', $id)->get();
        $pageTitle = 'Edit ' . $product->name . ' product';
        $categories = Category::all();
        $devices = Device::all();
        $platforms = Platform::all();
        $genres = Genre::all();
---
select * from `products` where `products`.`id` = '36' limit 1
select * from `product_images` where `product_id` = '36'
select * from `categories`
select * from `devices`
select * from `platforms`
select * from `genres`