application/app/Http/Controllers/SiteController.php

select * from `pages` where `tempname` = 'presets.default.' and `slug` = '/' limit 1
---
    public function index()
    {
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }
        $pageTitle = 'Home';
        $sections = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();